# Используйте официальный образ Node.js
FROM node:16

# Создайте директорию для приложения
WORKDIR /usr/src/app

# Сначала копируем только файлы package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Установите зависимости приложения
RUN npm install

# Копируйте все остальные исходные коды приложения в директорию приложения
COPY .. .

# Соберите TypeScript проект
RUN npm run build:ts

# Укажите порт, который приложение будет слушать
EXPOSE 8080

# Команда для запуска вашего приложения. Предполагается, что ваш TypeScript проект компилируется в dist/server.js
CMD [ "node", "dist/app.js" ]
